Alba8228/dualbrain-ai-car/STM32/user/api/delay.h
#ifndef __DELAY_H
#define __DELAY_H

#include "stm32f10x.h"

#define delay_1us()	{\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();\
}

extern uint16_t key_num;
extern uint16_t beep_flag;
extern uint16_t beep_num;
extern uint16_t sg90_num;

void Systick_Init(uint32_t load);
void Delay_us(uint32_t time);
void Delay_ms(uint32_t time);
#endif
